# Tabs
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'neovim/neovim'
tap 'thoughtbot/formulae'

# Setups
brew 'caskroom/cask/brew-cask'
brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'thoughtbot/formulae/rcm'
brew 'cask'

# Utilities
brew 'cmake'
brew 'wget'
brew 'make'
brew 'git'
brew 'svn'
brew 'the_silver_searcher'
brew 'hub', args: ['HEAD']
brew 'watchman'
brew 'ccat'
brew 'cloc'
brew 'ren'

# Vim
brew 'macvim', args: ['with-override-system-vim']
brew 'vim', args: ['with-lua']
brew 'tmux'

# Languages & DBs
brew 'go'
brew 'python3'
brew 'elixir'
brew 'rust'
brew 'lua'
brew 'n',
brew 'postgresql'
brew 'mongodb'

brew 'jpeg'
brew 'libpng'
brew 'libtiff'


brew 'imagemagick'
brew 'jp2a'
brew 'libevent'
brew 'libssh2'

brew 'scons'

brew 'msgpack'
brew 'node'
brew 'pcre'



brew 'spaceman-diff'
brew 'terminal-notifier'

# Images & Quick Look
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'

# Casks
# Cask Install a Ton of Things
cask '1password', args: { appdir: '/Applications' }
cask 'alfred', args: { appdir: '/Applications' }
cask 'cloud', args: { appdir: '/Applications' }
cask 'dropbox', args: { appdir: '/Applications' }
cask 'firefox', args: { appdir: '/Applications' }
cask 'github', args: { appdir: '/Applications' }
cask 'google-chrome', args: { appdir: '/Applications' }
cask 'hammerspoon', args: { appdir: '/Applications' }
cask 'imageoptim', args: { appdir: '/Applications' }
cask 'keepingyouawake', args: { appdir: '/Applications' }
cask 'rdio', args: { appdir: '/Applications' }
cask 'slack', args: { appdir: '/Applications' }
cask 'sketch', args: { appdir: '/Applications' }
cask 'screenhero', args: { appdir: '/Applications' }
cask 'sketch-toolbox', args: { appdir: '/Applications' }
