cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'neovim/neovim'

# Utilities
brew 'cmake'
brew 'wget'
brew 'git'
brew 'fzf'
brew 'svn'
brew 'the_silver_searcher'
brew 'hub', args: ['HEAD']
brew 'watchman'
brew 'mas'
brew 'ccat'
brew 'ren'
brew 'ranger'
brew 'lynx'
brew 'gnupg'
brew 'tig'
brew 'terminal-notifier'
brew 'tree'
brew 'dark-mode'
brew 'reattach-to-user-namespace'
brew 'yarn'
brew 'zsh'

# Vim
brew 'neovim/neovim/neovim', args: ['HEAD']
brew 'vim', args: ['with-lua', 'with-python3']
brew 'tmux'

# Languages & DBs
brew 'elixir'
brew 'python3'
brew 'node'

# Images & Quick Look
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'imagemagick'
brew 'jp2a'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'webpquicklook'

# Casks
cask 'sip'
cask '1password'
cask 'alfred'
cask 'dropbox'
cask 'screenhero'
cask 'figma'
cask 'google-chrome'
cask 'karabiner-elements'
cask 'webtorrent'
cask 'kap'
cask 'atom'
cask 'hyper'
cask 'spotify'
cask 'vimr'
cask 'phoenix'

# Mac App Store
mas 'Battery Indicator', id: 1206020918
mas 'Tweetbot', id: 557168941
