cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/sevices'
tap 'github/gh'
tap 'macvim-dev/macvim'
tap 'mongodb/brew'
tap 'schniz/tap'
tap 'nektos/tap'

# Utilities
brew 'exa'
brew 'fd'
brew 'cmake'
brew 'wget'
brew 'git'
brew 'git-extras'
brew 'gh'
brew 'git-delta'
brew 'fzf'
brew 'ripgrep'
brew 'svn'
brew 'the_silver_searcher'
brew 'hub', args: ['HEAD']
brew 'watchman'
brew 'mas'
brew 'ccat'
brew 'ren'
brew 'ranger'
brew 'lynx'
brew 'gnupg'
brew 'tig'
brew 'terminal-notifier'
brew 'tree'
brew 'dark-mode'
brew 'reattach-to-user-namespace'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

# Vim
brew 'vim', args: ['with-lua', 'with-python3']
brew 'neovim'
brew 'tmux'

# Languages & DBs
brew 'node'
brew 'schniz/tap/fnm'
brew 'mongodb/brew/mongodb-community'
brew 'golang'


# Casks
cask 'sip'
cask 'spectacle'

# Mac App Store
mas 'Contrast', id: 1254981365
mas 'Dato', id: 1470584107
mas 'EasyRes', id: 688211836
mas 'Gifski', id: 1351639930
mas 'HiddenMe Pro', id: 1007499919
mas 'iA Writer', id: 775737590
mas 'Slack', id: 803453959
mas 'VSee', id: 688688451
mas 'Xcode', id: 497799835
mas 'Battery Indicator', id: 1206020918
mas 'Lungo', id: 1263070803
